//IBMUSERL  JOB ,'MODEL DCB LIB80',
//             CLASS=A,MSGCLASS=X,MSGLEVEL=(1,1),
//             NOTIFY=&SYSUID
//********************************************************************
//* CATALOG A MODEL DSCB FOR A LIBRARY (PDSE) FOR 80-BYTE SOURCE
//********************************************************************
//CLEANUP  EXEC PGM=IEFBR14
//DD1      DD DSN=&SYSUID..MODELDCB.DCBLIB80,
//            DISP=(MOD,DELETE,DELETE),
//            UNIT=SYSDA,VOL=SER=USRVS1,
//            SPACE=(TRK,(0)),
//            DSNTYPE=LIBRARY,
//            DCB=(DSORG=PO,RECFM=FB,LRECL=80,BLKSIZE=27920)
//ALLOC    EXEC PGM=IEFBR14
//DD1      DD DSN=&SYSUID..MODELDCB.DCBLIB80,
//            DISP=(NEW,CATLG,DELETE),
//            UNIT=SYSDA,VOL=SER=USRVS1,
//            SPACE=(TRK,(0)),
//            DSNTYPE=LIBRARY,
//            DCB=(DSORG=PO,RECFM=FB,LRECL=80,BLKSIZE=27920)
