//IBMUSERM  JOB ,'MODEL DCB SEQ80',
//             CLASS=A,MSGCLASS=X,MSGLEVEL=(1,1),
//             NOTIFY=&SYSUID
//CLEANUP  EXEC PGM=IEFBR14
//DD1      DD DSN=&SYSUID..MODELDCB.DCBSEQ80,
//            DISP=(MOD,DELETE,DELETE),
//            UNIT=SYSDA,VOL=SER=USRVS1,
//            SPACE=(TRK,(0)),
//            DCB=(DSORG=PS,RECFM=FB,LRECL=80,BLKSIZE=16000)
//ALLOC    EXEC PGM=IEFBR14
//DD1      DD DSN=&SYSUID..MODELDCB.DCBSEQ80,
//            DISP=(NEW,CATLG,DELETE),
//            UNIT=SYSDA,VOL=SER=USRVS1,
//            SPACE=(TRK,(0)),
//            DCB=(DSORG=PS,RECFM=FB,LRECL=80,BLKSIZE=16000)
