//IBMUSERZ  JOB ,'LIST TARGET ZONE',
//             CLASS=A,MSGCLASS=X,MSGLEVEL=(1,1),REGION=0M,
//             NOTIFY=&SYSUID
//VERIFY  EXEC PGM=GIMSMP
//SMPCSI   DD DSN=SMPE.ZOS31.CSI,DISP=SHR
//SMPLOG   DD SYSOUT=*
//SMPOUT   DD SYSOUT=*
//SMPRPT   DD SYSOUT=*
//SMPLIST  DD SYSOUT=*
//SMPPTS   DD DSN=SMPE.ZOS31.SMPPTS,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SMPCNTL  DD *
 SET BOUNDARY(DLB31).
 LIST CLIST(ACBQADG4).
/*
