//IBMUSERT  JOB ,'TSO BATCH',
//             CLASS=A,MSGCLASS=X,MSGLEVEL=(1,1),
//             NOTIFY=&SYSUID
//STEP1    EXEC PGM=IKJEFT01,DYNAMNBR=75,TIME=1440
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//SYSTERM  DD DUMMY
//SYSTSIN  DD *
  LISTDS 'IBMUSER.*.JCL'
/*
