//IBMUSERP  JOB ,'PRINT CSI',
//             CLASS=A,MSGCLASS=X,MSGLEVEL=(1,1),
//             NOTIFY=&SYSUID
// EXPORT SYMLIST=(HLQ)
// SET HLQ=PLAT01
//DEFCSI   EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *,SYMBOLS=JCLONLY
 PRINT INDATASET(&HLQ..CHUMP.CSI) COUNT(1)
/*
