//IBMUSERL  JOB ,'LISTCAT',
//             CLASS=A,MSGCLASS=X,MSGLEVEL=(1,1),
//             NOTIFY=&SYSUID
//LISTCAT   EXEC PGM=IDCAMS
//SYSPRINT    DD SYSOUT=*
//SYSIN       DD *
  LISTCAT ENTRIES('SMPE.ZOS31.CSI') ALL
/*
